package janken.object;

public class Janken_Object {
	public static void main(String[] args) {
		/*
		 * 改良点
		 * 
		 * 1. 「プレイヤー１」のような味気ない名前ではなく、「村田さん」のようにそれぞれ好きな名前を表示できるようにする
		 * 2. プレイヤーの表示を２〜５人の間で自由に決められるようにする
		 * 3. プレイヤーの手の出し方を、すべてランダムではなくプレイヤーごとに変えられるようにする
		 * */
		
		/*
		 * 例1 3人でやる場合
		 * 
		 * A
		 * じゃんけんの掛け声と同時に、じゃんけんの手をだす
		 * 審判から勝敗をきく
		 * 自分の勝った回数を答える
		 * 
		 * B
		 * じゃんけんの掛け声と同時に、じゃんけんの手をだす
		 * 審判から勝敗をきく
		 * 自分の勝った回数を答える
		 * 
		 * C
		 * じゃんけんの開始を宣言する
		 * じゃんけんの掛け声をかける
		 * プレイヤーの手から勝敗を判定する
		 * 勝った回数を聞く
		 * （各プレイヤーの勝ち数から）最終的な勝者を判定する
		 * */
	}
}
